{
  "title": "Visual Data Science Lab - Weekly Seminar",
  "recent_talk": {
    "date": "Wed, Dec 4, 2024",
    "time": "11:00 - 12:00",
    "location": "Room 1114, 370 Jay St OR Join Zoom Meeting",
    "speakers": [
      {
        "name": "Mauro Diaz",
        "topic": "Safeguarding Large Language Models in Real-time with Tunable Safety-Performance Trade-offs"
      },
      {
        "name": "Andres de la Puente",
        "topic": "Understanding, Enhancing, and Augmenting Human Interaction through Adaptive Systems"
      }
    ]
  },
  "talk_details": [
    {
      "topic": "Safeguarding Large Language Models in Real-time with Tunable Safety-Performance Trade-offs",
      "image": "/images/maurodiaz.jpg",
      "speaker": "Andrew Bell",
      "advisor": "Julia Stoyanovich",
      "description": "Large Language Models (LLMs) have been shown to be susceptible to jailbreak attacks, or adversarial attacks used to illicit high risk behavior from a model. Jailbreaks have been exploited by cybercriminals and blackhat actors to cause significant harm, highlighting the critical need to safeguard widely-deployed models. Safeguarding approaches, which include fine-tuning models or having LLMs 'self-reflect', may lengthen the inference time of a model, incur a computational penalty, reduce the semantic fluency of an output, and restrict 'normal' model behavior. Importantly, these Safety-Performance Trade-offs (SPTs) remain an understudied area. In this work, we introduce a novel safeguard, called SafeNudge, that combines Controlled Text Generation with 'nudging,' or using text interventions to change the behavior of a model. SafeNudge triggers during text-generation while a jailbreak attack is being executed, and can reduce successful jailbreak attempts by 30% by guiding the LLM towards a safe response. It adds minimal latency to inference and has a negligible impact on the semantic fluency of outputs. Further, we allow for tunable SPTs. SafeNudge is open-source and available through https://pypi.org/, and is compatible with models loaded with the Hugging Face transformers library."
    },
    {
      "topic": "Understanding, Enhancing, and Augmenting Human Interaction through Adaptive Systems",
      "image": "/images/andresdelapuente.jpeg",
      "speaker": "Jewelina Wen",
      "advisor": "Claudio Silva",
      "description": "By leveraging computational methods, physiological sensing, and AI-driven adaptation, I develop intelligent interfaces that dynamically respond to users’ cognitive and behavioral states, optimizing experience and performance in real time. My work spans aviation, driving assistance, healthcare, and gaming, demonstrating the impact of adaptive systems across diverse domains."
    }
  ],
  "upcoming_events": [
    {
      "date": "Mar 12, 2025",
      "time": "11:00 - 11:30",
      "location": "Room 1114, 370 Jay St",
      "speaker": "TBD",
      "topic": "Topic Modelling for Large-Scale Text Data"
    },
    {
      "date": "Mar 12, 2025",
      "time": "11:30 - 12:00",
      "location": "Room 1114, 370 Jay St",
      "speaker": "TBD",
      "topic": "Data Visualization for Large-Scale Text Data"
    }
  ],
  "historical_events": [
    {
      "date": "Nov 6, 2024",
      "presentations": [
        {
          "speaker": "Teal Witter",
          "title": "Provably Accurate Estimators for Shapley Values",
          "links": {
            "recording": true,
            "slides": true
          }
        },
        {
          "speaker": "Niv Cohen",
          "title": "Discovering and Erasing Undesired Concepts",
          "links": {
            "recording": true,
            "slides": true
          }
        }
      ]
    },
    {
      "date": "Nov 20, 2024",
      "presentations": [
        {
          "speaker": "Alexander Ratzan",
          "title": "Molecular Connectomics from Small to Large Brains",
          "links": {
            "recording": true,
            "slides": true
          }
        },
        {
          "speaker": "Felipe Inagaki de Oliveira",
          "title": "TopoMap++: A faster and more space efficient technique to compute projections with topological guarantees",
          "links": {
            "recording": true,
            "slides": true
          }
        }
      ]
    },
    {
      "date": "Dec 4, 2024",
      "presentations": [
        {
          "speaker": "Guande Wu",
          "title": "Evaluating Collaborative Capabilities of Language Models",
          "links": {
            "recording": true,
            "slides": true
          }
        },
        {
          "speaker": "Aécio Santos",
          "title": "Sampling-Based Sketching Methods for Correlated Data Discovery",
          "links": {
            "recording": true,
            "slides": true
          }
        }
      ]
    }
  ]
}
